#include<stdio.h>

void main() {

	// 국비 학원 2일차

	// \ : 줄바꿈
	// a : 알람소리 난다고 함
	// r : 출력위치를 맨 앞으로 옮겨짐
	// b : 왼쪽으로 한칸
	// 컨트롤 x : 줄 잘라내기
	// 알트 : 부분지정 ,
	// 홈,엔드버튼 : 앞,뒤 버튼
	printf("반가워 안녕\n");
	printf("어서와\n");
	printf("코딩은 처음이지\n");
	printf("\n");

	// 정수출력 : %d
	// 문자출력 : %s
	printf("%d\n", 10);

	printf("%f\n", 3.14);
	// 실수 출력 : %f
	
	printf("%.2lf\n", 3.14);
	// %.2lf = 소수점 둘째자리까지 출력


	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 1, 2 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 2, 2 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 3, 2 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 4, 2 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 5, 2 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 6, 2 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 7, 2 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 8, 2 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 2, 9, 2 * 9);
	
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 1, 3 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 2, 3 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 3, 3 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 4, 3 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 5, 3 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 6, 3 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 7, 3 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 8, 3 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 3, 9, 3 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 1, 4 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 2, 4 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 3, 4 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 4, 4 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 5, 4 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 6, 4 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 7, 4 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 8, 4 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 4, 9, 4 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 1, 5 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 2, 5 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 3, 5 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 4, 5 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 5, 5 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 6, 5 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 7, 5 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 8, 5 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 5, 9, 5 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 1, 6 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 2, 6 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 3, 6 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 4, 6 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 5, 6 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 6, 6 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 7, 6 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 8, 6 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 6, 9, 6 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 1, 7 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 2, 7 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 3, 7 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 4, 7 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 5, 7 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 6, 7 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 7, 7 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 8, 7 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 7, 9, 7 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 1, 8 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 2, 8 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 3, 8 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 4, 8 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 5, 8 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 6, 8 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 7, 8 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 8, 8 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 8, 9, 8 * 9);

	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 1, 9 * 1);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 2, 9 * 2);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 3, 9 * 3);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 4, 9 * 4);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 5, 9 * 5);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 6, 9 * 6);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 7, 9 * 7);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 8, 9 * 8);
	printf("%d와(과) %d의 곱은 %d 입니다.\n", 9, 9, 9 * 9);




}